# ; Задача: предложить улучшения кода для уже решённых задач:
# Задача 4 из 3го Семинара
# Напишите программу, которая будет преобразовывать десятичное 
# число в двоичное.

# *Пример:*

# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10



# ; С помощью использования **лямбд, filter, map, zip, enumerate, list comprehension
# ; 3 любых задания(из любого урока)

x=int(input("введите число для преобразования в Двоичную систему: "))
print(format(x, 'b')) 
