# Вычислить число Пи c заданной точностью d

# *Пример:* 

# - при d = 0.001, π = 3.141
# - при d = 0.0001, π = 3.1415  
import os 
os.system('cls')


d=int(input('Пссс, парень, как глубоко показать мой Пи?  '))
k=1
x=0
for k in range(1,10000000):
    x=x+4*((-1)**(k+1))/(2*k-1)
print(round(x,d))